import React, { useState } from 'react';

import css from '../profile.module.scss'


import RecruiterCard from '@/components/Profile/Recruiter/RecruiterCard';
import RecruiterDetail from '@/components/Profile/Recruiter/RecruiterDetail';


const hr = [
    {
        recruiter: {
            logo: "https://djinni.co/api/imgproxy/-uvoyTuU6XlKfnWog-PBWnel932YXvV-boWERB7GkvY/rs:fit:280:280:True/aHR0cHM6Ly9wLmRq/aW5uaS5jby9iZi82/NzMwYTc2MjI2M2Ix/YzI2Y2NmNjdkZTNl/NzY2OWQvMkQ4QUUx/ODgtMDZGRS00ODM3/LTg4RUYtMDk4NUMy/MTlCNzg4XzQwMC5q/cGc.jpg",
            name: 'Sardor Isarilov',
            post: 'Гланый CEO',
            number: '+996502772777',
            email: 'sardor_09062002@mail.ru',
            about: 'Активная жизненная позиция, развитые коммуникативные навыки, стремление к обучению и саморазвитию, умение легко воспринимать крупные объемы информации, умение применять творческий подход в работе, умение доносить информацию, объяснять сложные вещи простым языком, вежливость и тактичность в общении, высокая энергичность, инициативность, способность быстро реагировать и приспосабливаться к меняющимся условиям, способность анализировать проблемы и искать пути решения, умение планировать, умение проявлять гибкость.',
            experience: '7',
            progress: 'Implemented Test Driven Development with 90% test coverage and created smooth CI/CD pipeline in GitHub Actions.',
            work_experience: [
                {
                    logo: "https://img.freepik.com/free-icon/search_318-265146.jpg?w=2000",
                    title: "Google",
                    sphere: 'Продуктовая IT- компания.Драйвер автоматизации бизнес - процессов',
                    date_work: "Октябрь 2022 — Март 2023",
                    descr: " Полный цикл подбора IT специалистов: разработчики back - end, front - end, fullstack, scrum maser, верстальщики.Уровень от Junior до Lead. Взаимодействие с заказчиками, составление описания вакансии, согласование условий и публикация вакансий; Поиск кандидатов через внутренние и внешние рекомендации, прямой поиск на hh, хабр карьере, телегам, LinkedIn, использование boolean search x- pay запросов."
                },
                {
                    logo: "https://img.freepik.com/free-icon/search_318-265146.jpg?w=2000",
                    title: "Figma",
                    sphere: 'Продуктовая IT- компания.Драйвер автоматизации бизнес - процессов',
                    date_work: "Март 2021 — Октябрь 2022",
                    descr: " Полный цикл подбора IT специалистов: разработчики back - end, front - end, fullstack, scrum maser, верстальщики.Уровень от Junior до Lead. Взаимодействие с заказчиками, составление описания вакансии, согласование условий и публикация вакансий; Поиск кандидатов через внутренние и внешние рекомендации, прямой поиск на hh, хабр карьере, телегам, LinkedIn, использование boolean search x- pay запросов."
                },
            ],
            links: [
                {
                    icon: <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" data-supported-dps="24x24" fill="#0a66c2" width="24" height="24" focusable="false">
                        <path d="M20.5 2h-17A1.5 1.5 0 002 3.5v17A1.5 1.5 0 003.5 22h17a1.5 1.5 0 001.5-1.5v-17A1.5 1.5 0 0020.5 2zM8 19H5v-9h3zM6.5 8.25A1.75 1.75 0 118.3 6.5a1.78 1.78 0 01-1.8 1.75zM19 19h-3v-4.74c0-1.42-.6-1.93-1.38-1.93A1.74 1.74 0 0013 14.19a.66.66 0 000 .14V19h-3v-9h2.9v1.3a3.11 3.11 0 012.7-1.4c1.55 0 3.36.86 3.36 3.66z"></path>
                    </svg>,
                    link: "https://www.linkedin.com/in/sardor-israilov-9b2b2a239/",
                    title: "Sardor Israilov"
                },
                {
                    icon: <svg viewBox="0 0 34 34" width="133" xmlns="http://www.w3.org/2000/svg">
                        <g fill="#2481cc" fillRule="evenodd">
                            <circle cx="17" cy="17" fill="" r="17"></circle>
                            <path d="m7.06510669 16.9258959c5.22739451-2.1065178 8.71314291-3.4952633 10.45724521-4.1662364 4.9797665-1.9157646 6.0145193-2.2485535 6.6889567-2.2595423.1483363-.0024169.480005.0315855.6948461.192827.1814076.1361492.23132.3200675.2552048.4491519.0238847.1290844.0536269.4231419.0299841.65291-.2698553 2.6225356-1.4375148 8.986738-2.0315537 11.9240228-.2513602 1.2428753-.7499132 1.5088847-1.2290685 1.5496672-1.0413153.0886298-1.8284257-.4857912-2.8369905-1.0972863-1.5782048-.9568691-2.5327083-1.3984317-4.0646293-2.3321592-1.7703998-1.0790837-.212559-1.583655.7963867-2.5529189.2640459-.2536609 4.7753906-4.3097041 4.755976-4.431706-.0070494-.0442984-.1409018-.481649-.2457499-.5678447-.104848-.0861957-.2595946-.0567202-.3712641-.033278-.1582881.0332286-2.6794907 1.5745492-7.5636077 4.6239616-.715635.4545193-1.3638349.6759763-1.9445998.6643712-.64024672-.0127938-1.87182452-.334829-2.78737602-.6100966-1.12296117-.3376271-1.53748501-.4966332-1.45976769-1.0700283.04048-.2986597.32581586-.610598.8560076-.935815z" fill="white"></path>
                        </g>
                    </svg>,
                    link: "https://t.me/israilov02",
                    title: "Sardor Israilov"
                },
                {
                    icon: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M17 20.5H7C4 20.5 2 19 2 15.5V8.5C2 5 4 3.5 7 3.5H17C20 3.5 22 5 22 8.5V15.5C22 19 20 20.5 17 20.5Z" stroke="#292D32" strokeWidth="1.5" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                        <path d="M17 9L13.87 11.5C12.84 12.32 11.15 12.32 10.12 11.5L7 9" stroke="#292D32" strokeWidth="1.5" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                    </svg>,
                    link: "sardor_09062002@mail.ru",
                    title: "Sardor Israilov"
                },
                {
                    icon: <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path d="M12 0c-6.626 0-12 5.373-12 12 0 5.302 3.438 9.8 8.207 11.387.599.111.793-.261.793-.577v-2.234c-3.338.726-4.033-1.416-4.033-1.416-.546-1.387-1.333-1.756-1.333-1.756-1.089-.745.083-.729.083-.729 1.205.084 1.839 1.237 1.839 1.237 1.07 1.834 2.807 1.304 3.492.997.107-.775.418-1.305.762-1.604-2.665-.305-5.467-1.334-5.467-5.931 0-1.311.469-2.381 1.236-3.221-.124-.303-.535-1.524.117-3.176 0 0 1.008-.322 3.301 1.23.957-.266 1.983-.399 3.003-.404 1.02.005 2.047.138 3.006.404 2.291-1.552 3.297-1.23 3.297-1.23.653 1.653.242 2.874.118 3.176.77.84 1.235 1.911 1.235 3.221 0 4.609-2.807 5.624-5.479 5.921.43.372.823 1.102.823 2.222v3.293c0 .319.192.694.801.576 4.765-1.589 8.199-6.086 8.199-11.386 0-6.627-5.373-12-12-12z" /></svg>,
                    link: "https://github.com/IsrailovSardor",
                    title: "Sardor Israilov"
                }
            ],
        },
        company: {
            descr: 'Программное обеспечение меняет мир. Австралийская компания Atlassian (www.atlassian.com) помогает измениться командам, создающим программное обеспечение. Мы делаем продукты Atlassian доступнее для этих команд и помогаем использовать их более эффективно. Более 40 000 компаний по всему миру используют продукты Atlassian для оптимизации бизнес-процессов, поддержки эффективных коммуникаций и продуктивной совместной работы. У нас небольшой дружный коллектив и занимаемся мы продвижением на российском рынке замечательных программных продуктов австралийской компании Atlassian (www.atlassian.com). Наша деятельность покрывает весь спектр компетенций по продуктам JIRA, Confluence и Developer Tools: ',
            title: 'Google',
            logo: 'https://img.freepik.com/free-icon/search_318-265146.jpg?w=2000',
            sphere: 'Продуктовая IT- компания.Драйвер автоматизации бизнес - процессов',
            location: 'USA',
            employer: '100',
            our_values: [
                { title: "Качество как основной ориентир в работе над продуктом, сервисом, процессами." },
                { title: "Прозрачность и открытость бизнеса как гарантия законности и справедливости принимаемых решений." },
                { title: "Нестандартный подход к решению задач как способ развития сотрудников." },
                { title: "Экологичность - как отражение нашего отношения к коллегам, клиентам, партнерам и окружающему миру." },
                { title: "Гибкость как отражение нашего отношения к вызовам конкурентного рынка финансовых услуг и высоких технологий." },
                { title: "Индивидуальность каждого сотрудника как основной критерий для формирования команды." },
                { title: "Экономика восприятия - как отношение к сервису, который создает каждый из нас." },
            ],
            links: [
                {
                    icon: <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" data-supported-dps="24x24" fill="#0a66c2" width="24" height="24" focusable="false">
                        <path d="M20.5 2h-17A1.5 1.5 0 002 3.5v17A1.5 1.5 0 003.5 22h17a1.5 1.5 0 001.5-1.5v-17A1.5 1.5 0 0020.5 2zM8 19H5v-9h3zM6.5 8.25A1.75 1.75 0 118.3 6.5a1.78 1.78 0 01-1.8 1.75zM19 19h-3v-4.74c0-1.42-.6-1.93-1.38-1.93A1.74 1.74 0 0013 14.19a.66.66 0 000 .14V19h-3v-9h2.9v1.3a3.11 3.11 0 012.7-1.4c1.55 0 3.36.86 3.36 3.66z"></path>
                    </svg>,
                    link: 'https://www.linkedin.com/in/sardor-israilov-9b2b2a239/',
                    title: 'Sardor Israilov'
                },
                {
                    icon: <svg viewBox="0 0 34 34" width="133" xmlns="http://www.w3.org/2000/svg">
                        <g fill="#2481cc" fillRule="evenodd">
                            <circle cx="17" cy="17" fill="" r="17"></circle>
                            <path d="m7.06510669 16.9258959c5.22739451-2.1065178 8.71314291-3.4952633 10.45724521-4.1662364 4.9797665-1.9157646 6.0145193-2.2485535 6.6889567-2.2595423.1483363-.0024169.480005.0315855.6948461.192827.1814076.1361492.23132.3200675.2552048.4491519.0238847.1290844.0536269.4231419.0299841.65291-.2698553 2.6225356-1.4375148 8.986738-2.0315537 11.9240228-.2513602 1.2428753-.7499132 1.5088847-1.2290685 1.5496672-1.0413153.0886298-1.8284257-.4857912-2.8369905-1.0972863-1.5782048-.9568691-2.5327083-1.3984317-4.0646293-2.3321592-1.7703998-1.0790837-.212559-1.583655.7963867-2.5529189.2640459-.2536609 4.7753906-4.3097041 4.755976-4.431706-.0070494-.0442984-.1409018-.481649-.2457499-.5678447-.104848-.0861957-.2595946-.0567202-.3712641-.033278-.1582881.0332286-2.6794907 1.5745492-7.5636077 4.6239616-.715635.4545193-1.3638349.6759763-1.9445998.6643712-.64024672-.0127938-1.87182452-.334829-2.78737602-.6100966-1.12296117-.3376271-1.53748501-.4966332-1.45976769-1.0700283.04048-.2986597.32581586-.610598.8560076-.935815z" fill="white"></path>
                        </g>
                    </svg>,
                    link: 'https://t.me/israilov02',
                    title: 'Sardor Israilov'
                },
                {
                    icon: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M17 20.5H7C4 20.5 2 19 2 15.5V8.5C2 5 4 3.5 7 3.5H17C20 3.5 22 5 22 8.5V15.5C22 19 20 20.5 17 20.5Z" stroke="#292D32" strokeWidth="1.5" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                        <path d="M17 9L13.87 11.5C12.84 12.32 11.15 12.32 10.12 11.5L7 9" stroke="#292D32" strokeWidth="1.5" strokeMiterlimit="10" strokeLinecap="round" strokeLinejoin="round" />
                    </svg>
                    ,
                    link: 'sardor_09062002@mail.ru',
                    title: 'Sardor Israilov'
                }
            ],
            benefit: [
                { title: 'Своевременная оплата труда' },
                { title: 'Удаленная работа' },
                { title: 'Профессиональное обучение' },
                { title: 'Гибкий рабочий график' },
                { title: 'Оплата больничного' },
                { title: 'Удобное расположение работы' },
                { title: 'Корпоративные мероприятия' },
                { title: 'Система наставничества' },
                { title: 'Медицинское страхование' },
                { title: 'Наличие кухни, места для обеда' }
            ],
            email: 'sardor_09062002@mail.ru',
            vacansy: [
                {
                    title: 'Senior Java',
                    link: '/vacancy/1'
                },
                {
                    title: 'Senior UX',
                    link: '/vacancy/1'
                },
                {
                    title: 'Senior HUR',
                    link: '/vacancy/1'
                }
            ]
        }
    }
]

const Recruiter = () => {
    const [mode, setMode] = useState(1)

    return (
        <div className={css.wrapper}>
            {hr.map((item, index) => (
                <div className={css.container} key={index}>
                    <RecruiterDetail item={item} mode={mode} setModeOne={() => setMode(1)} setModeTwo={() => setMode(2)} />
                    <RecruiterCard item={item} mode={mode} />
                </div>
            ))}
        </div >
    );
};

export default Recruiter;